skeleton/app/controllers/api/feeds_controller.rb

  def index
    render :json => Feed.all
---
SELECT "feeds".* FROM "feeds" ORDER BY "feeds"."id" ASC

  def show
    # debugger
    render :json => Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]